## Remove Duplicate Datasets

Duplicate Records can skew our analysis.

In [3]:
import pandas as pd

import numpy as np

from pandas import Series, DataFrame

In [4]:
DF_object  = DataFrame({'column1':[1,1,2,2,3,3,3],
                        'column 2':['a','a','b','b','c','c','c'],
                        'column 3':['A','A','B','B','C','C','C']
                        })

In [6]:
print(DF_object)

   column1 column 2 column 3
0        1        a        A
1        1        a        A
2        2        b        B
3        2        b        B
4        3        c        C
5        3        c        C
6        3        c        C

In [7]:
DF_object.duplicated()

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

In [8]:
DF_object.drop_duplicates()

   column1 column 2 column 3
0        1        a        A
2        2        b        B
4        3        c        C

In [9]:
DF_object1 = DataFrame({'column1':[1,1,2,2,3,3,3],
                        'column 2':['a','a','b','b','c','c','c'],
                        'column 3':['A','A','B','B','C','D','C']
                        })

In [11]:
print(DF_object1)

   column1 column 2 column 3
0        1        a        A
1        1        a        A
2        2        b        B
3        2        b        B
4        3        c        C
5        3        c        D
6        3        c        C

In [13]:
DF_object1.drop_duplicates()

   column1 column 2 column 3
0        1        a        A
2        2        b        B
4        3        c        C
5        3        c        D

In [14]:
DF_object1.drop_duplicates(['column 3'])

   column1 column 2 column 3
0        1        a        A
2        2        b        B
4        3        c        C
5        3        c        D

In [15]:
DF_object2 = DataFrame({'column1':[1,1,2,2,3,3,3],
                        'column 2':['a','a','b','b','c','c','c'],
                        'column 3':['A','B','C','D','E','F','G']
                        })

In [16]:
DF_object2

   column1 column 2 column 3
0        1        a        A
1        1        a        B
2        2        b        C
3        2        b        D
4        3        c        E
5        3        c        F
6        3        c        G

In [17]:
DF_object2.drop_duplicates(['column 2'])

   column1 column 2 column 3
0        1        a        A
2        2        b        C
4        3        c        E

In [18]:
DF_object2.drop_duplicates()

   column1 column 2 column 3
0        1        a        A
1        1        a        B
2        2        b        C
3        2        b        D
4        3        c        E
5        3        c        F
6        3        c        G